import pytest

from src.autoscription.core.extract_metadata import extract_dosages


class TestExtractDosages:
    @pytest.mark.parametrize(
        "given_input, expected",
        [
            ("1 ΟΦΘ.ΣΤΑΓΟΝΕΣ ΔΟΣΕΙΣ x 1 φορά την ημέρα x 30 ημέρες", 0.05),
            ("2.5 ΠΟΣ.ΔΙΑΛΥΜΑ ML x 2 φορές την ημέρα x 3 ημέρες", 2.5),
            ("16 ΠΟΣ.ΣΤΑΓΟΝΕΣ x 1 φορά την ημέρα x 30 ημέρες", 0.8),
            ("16 ΠΟΣ.ΣΤΑΓΟΝΕΣ MLx 1 φορά την ημέρα x 30 ημέρες", 0.8),  # this is an extreme that has not happened yet
            ("20 ΠΟΣΙΜΕΣ ΣΤΑΓΟΝΕΣ, ΔΙΑΛΥΜΑ x 2 φορές την ημέρα x 60 ημέρες", 1.0),
            ("1/2 ΟΤΙΚΟ ΣΤΑΓΟΝΕΣ x 2 φορές την ημέρα x 5 ημέρες", 0.025),
            ("1/4 ΔΙΣΚΙΑ ΕΠΙΚΑΛ x 2 φορές την ημέρα x 30 ημέρες", 0.25),
            ("1 ΔΙΣΚΙΑ ΑΝΑΒΡ x 1 φορά την εβδομάδα x 30 ημέρες", 1.0),
            ("100 ΚΑΨΟΥΛΕΣ ΕΝΤΕΡΟΔΙΑΛ x 1 φορά την ημέρα x 30 ημέρες", 100.0),
            ("11 ΣΙΡΟΠΙ ML x 1 φορά την ημέρα x 30 ημέρες", 11.0),
            ("1 ΟΦΘ.ΣΤΑΓΟΝΕΣ ΔΟΣΕΙΣ x 1 φορά την ημέρα x 30 ημέρες", 0.05),
            ("8.5 ΠΟΣ.ΔΙΑΛΥΜΑ ML x 2 φορές την ημέρα x 7 ημέρες", 8.5),
            ("1 ΥΠΟΘΕΤΑ x 2 φορές την ημέρα x 5 ημέρες", 1.0),
            ("12 ΠΟΣ.ΣΤΑΓΟΝΕΣ x 1 φορά την ημέρα x 30 ημέρες", 0.6000000000000001),
            ("1 ΕΚΧΥΣΗ ΔΙΑΛ ΦΥΣΙΓΓΕΣ x εφάπαξ x 1 ημέρες", 1.0),
            ("1 ΕΙΣΠΝOΕΣ ΣΚΟΝΗ ΔΟΣΕΙΣ x 1 φορά την ημέρα x 30 ημέρες", 1.0),
            ("1.5 ΔΙΣΚΙΑ ΕΠΙΚΑΛ x 1 φορά την ημέρα x 28 ημέρες", 1.5),
            ("40 ΕΝΕΣΗ ΔΙΑΛ ΦΥΣΙΓΓΕΣ x 1 φορά την ημέρα x 30 ημέρες", 40.0),
            ("1/2 ΠΟΣ.ΔΙΑΛΥΜΑ ML x 1 φορά την ημέρα x 30 ημέρες", 0.5),
            ("6.5 ΠΟΣ.ΔΙΑΛΥΜΑ ML x 2 φορές την ημέρα x 10 ημέρες", 6.5),
            ("6.5ΠΟΣ.ΔΙΑΛΥΜΑMLx2φορέςτηνημέραx10ημέρες", 6.5),
            ("1 g x 3 φορές την ημέρα x 30 ημέρες", 1.0),
            ("1 11ml ανα 8 ωρες  για 30 ημερες x 3 φορές την ημέρα x 60 ημέρες", 11.0),
            ("1 250ml x 3 φορές την ημέρα x 60 ημέρες", 250.0),
            ("1/2 ΕΝΕΣΗ ΔΙΑΛ ΦΥΣΙΓΓΕΣ x 1 φορά την εβδομάδα x 30 ημέρες", 0.5),
            ("1 ΕΠΑΛΕΙΨΗ ΝΥΧΙΑ  x 1 φορά την ημέρα x 23 ημέρες", 1.0),
            ("1 ΠΟΣ.ΔΙΑΛ ΔΟΣΕΙΣ 15ML x 1 φορά την ημέρα x 28 ημέρες", 15.0),
            ("1 ΠΟΣ.ΔΙΑΛ ΔΟΣΕΙΣ 1.5ML x 1 φορά την ημέρα x 28 ημέρες", 1.5),
            ("2.5 ΠΟΣ.ΔΙΑΛΥΜΑ ML x 1 φορά την ημέρα x 30 ημέρες", 2.5),
            ("1/4 ΠΟΣ.ΔΙΑΛΥΜΑ ML x 3 φορές την ημέρα x 30 ημέρες", 0.25),
            ("1 ΠΟΣ.ΔΙΑΛ ΔΟΣΕΙΣ 5ML x κάθε 2 εβδομάδες x 30 ημέρες", 5.0),
            (" 2 ΠΟΣ ΔΙΑΛΥΜΑ 1ML x 2 φορές την ημέρα x 30 ημέρες", 2.0),
        ],
    )
    def test_number_doses(self, given_input: str, expected: int) -> None:
        assert extract_dosages(given_input) == expected
